Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: In most cases, users benefit from these features without any additional work on your part.
ja: 多くの場合には、ユーザはこれらの機能から、あなたの受け持ちでの何らかの追加的作業なしで利益を受けます。

source: In other words, many of the events generated by the user are initially routed to the first responder.
ja: 言い換えれば、ユーザによって生み出されるイベントの多くは初めにファーストレスポンダに向かいます。

source: In other words, this if statement gets executed when you are editing an existing meal.
ja: 言い換えれば、このif文は、あなたが既存の食事を編集しているならば実行されます。

source: In other words, this else statement executes when the user adds a new meal.
ja: 言い換えれば、このelse文はユーザが新しい食事を加える時に実行されます。

source: In response, the system creates an application object.
ja: 応答して、システムはアプリケーションオブジェクトを作成します。

source: In the //MARK: Private Methods section, just before the last curly brace (}), add the following method:
ja: //MARK: Private Methods節において、最後の波括弧（}）の直前に、以下のメソッドを加えてください：

source: In the PropertyKey structure, add these properties:
ja: このPropertyKey構造体において、これらのプロパティを加えてください：

source: In the button.heightAnchor.constraint() method call, change 44.0 to starSize.height.
ja: button.heightAnchor.constraint()メソッド呼び出しにおいて、44.0をstarSize.heightに変えてください。

source: In the button.widthAnchor.constraint() method call, change 44.0 to starSize.width.
ja: button.widthAnchor.constraint()メソッド呼び出しにおいて、44.0をstarSize.widthに変えてください。

source: In the cancel(_:) action method, add the following line of code:
ja: cancel(_:)アクションメソッドにおいて、以下のコード行を加えてください：

source: In the cancel(_:) action method, before the existing line of code, add the following code:
ja: cancel(_:)アクションメソッドにおいて、既存のコード行の前で、以下のコード加えてください：

source: In the encode(with:) method, add the following code:
ja: encode(with:)メソッドにおいて、以下のコードを加えてください：

source: In the for-in declaration, change 5 to starCount.
ja: for-in宣言において、5をstarCountに変えてください。

source: In the if statement, add the following code:
ja: if文において、以下のコードを加えてください：

source: In the if statement, below the previous line of code, add the following code:
ja: if文において、前のコード行の下で、以下のコードを加えてください：

source: In the loadMeals() method, add the following line of code:
ja: loadMeals()メソッドにおいて、以下のコード行を加えてください：

source: In the loadSampleMeals() method, start by loading the three meal images:
ja: loadSampleMeals()メソッドにおいて、３つの食事画像をロードすることで始めてください：

source: In the prepare(for:sender:) method, add a call to the superclass’s implementation:
ja: prepare(for:sender:)メソッドにおいて、スーパークラスの持つ実装への呼び出しを加えてください。

source: In the saveMeals() method, add the following line of code:
ja: このsaveMeals()メソッドにおいて、以下のコード行を加えてください：

source: In the setupButtons() method, add a call to the updateButtonSelectionStates() method just above the method’s closing curly brace (}).
ja: setupButtons()メソッドにおいて、updateButtonSelectionStates()メソッドへの呼び出しをそのメソッドの閉じ波カッコ（}）のすぐ上に加えてください。

source: In the setupButtons() method, add the following lines of code to create a red button:
ja: setupButtons()メソッドにおいて、以下のコード行を加えることで赤いボタンを作成してください。

source: In the unwindToMealList(_:) action method, add the following if statement:
ja: unwindToMealList(_:)アクションメソッドにおいて、以下のif文を加えてください：

source: In the updateButtonSelectionStates() method, add the following for-in loop:
ja: updateButtonSelectionStates()メソッドにおいて、以下のfor-inループを加えてください：

source: In the viewDidLoad() method, delete the comments and add this code after the call to super.viewDidLoad() to load the sample meal data:
ja: viewDidLoad()メソッドにおいて、コメントを削除してこのコードをsuper.viewDidLoad()への呼び出しの後に加えることで見本の食事データをロードしてください：

source: In the Attributes inspector, type ShowDetail in the Identifier field.
ja: Attributesインスペクタにおいて、ShowDetailをIdentifier（識別子）欄にタイプしてください。

source: In the project navigator, select Assets.xcassets to view the asset catalog.
ja: プロジェクトナビゲータにおいて、Assets.xcassetsを選択してアセットカタログ（資産目録）を眺めてください。

source: In the Add New Constraints menu, click the Add 1 Constraint button.
ja: Add New Constraintsメニューにおいて、Add 1 Constraintボタンをクリックしてください。

source: In the Add New Constraints menu, click the Add 3 Constraints button.
ja: Add New Constraintsメニューにおいて、Add 3 Constraintsボタンをクリックしてください。

source: In the Application section, select Single View Application and then click Next.
ja: 「Application」セクションにおいて、Single View Applicationをクリックして、それからNextをクリックしてください。

source: In the Attributes inspector , find the field labeled Return Key and select Done (scroll down if necessary).
ja: Attributesインスペクタにおいて、「Return Key」と表示のある欄を捜して「Done」を選択してください（必要なら下にスクロールしてください）。

source: In the Attributes inspector, choose Add from the pop-up menu next to the System Item option.
ja: Attributesインスペクタにおいて、AddをSystem Itemオプションの隣のポップアップメニューから選んでください。

source: In the Attributes inspector, choose Present Modally from the Kind field’s pop-up menu.
ja: Attributesインスペクタにおいて、Present ModallyをKind欄のポップアップメニューから選んでください。

source: In the Attributes inspector, find the Alignment field and select Center.
ja: Attributesインスペクタにおいて、Alignment欄を見つけてCenterを選択してください。

source: In the Attributes inspector, find the Image field and select defaultPhoto.
ja: Attributesインスペクタにおいて、Imageフィールドを見つけてdefaultPhotoを選択してください。

source: In the Attributes inspector, find the Interaction field and select the User Interaction Enabled checkbox.
ja: Attributesインスペクタにおいて、Interaction（相互作用）欄を捜して、User Interaction Enabled（ユーザ相互作用を可能にする）チェックボックスを選択してください。

source: In the Attributes inspector, find the field labeled Identifier and type MealTableViewCell.
ja: Attributesイスンペクタにおいて、Identifierとラベルをつけられる欄を見つけてMealTableViewCellとタイプしてください。

source: In the Attributes inspector, find the field labeled Image and select defaultPhoto.
ja: Attributesインスペクタにおいて、Imageとラベルをつけられる欄を探してdefaultPhotoを選択します。

source: In the Attributes inspector, find the field labeled Placeholder and type Enter meal name.
ja: Attributesインスペクタにおいて、Placeholderと表示される欄を見つけてEnter meal nameとタイプしてください。

source: In the Attributes inspector, for System Item, select Cancel.
ja: Attributesインスペクタにおいて、System Itemに対して、Cancelを選択してください。

source: In the Attributes inspector, for System Item, select Save.
ja: Attributesインスペクタにおいて、System Itemに対して、Saveを選択してください。

source: In the Attributes inspector, select the Auto-enable Return Key checkbox (again, scroll down if necessary).
ja: Attributesインスペクタにおいて、「Auto-enable Return Key」チェックボックスを選択してください（再び、必要なら下にスクロールしてください）。

source: In the Attributes inspector, set the Spacing to 8.
ja: Attributesインスペクタにおいて、Spacingを８に設定してください。

source: In the Attributes inspector, type 8 in the Spacing field.
ja: Attributesインスペクタにおいて、8をSpacing欄でタイプしてください。

source: In the Attributes inspector, type AddItem in the Identifier field.
ja: Attributesインスペクタにおいて、AddItemをIdentifier（識別子）欄にタイプしてください。

source: In the Class field, type Meal.
ja: Class欄において、Mealをタイプしてください。

source: In the Class field, type RatingControl.
ja: Class欄において、RatingControlをタイプします。

source: In the Identity inspector, change the Class field from ViewController to MealViewController.
ja: 同一性インスペクタにおいて、Class欄をViewControllerからMealViewControllerに変更してください。

source: In the Identity inspector, find the Class field and select MealTableViewCell.
ja: Identityインスペクタにおいて、Class欄を捜してMealTableViewCellを選択してください。

source: In the Identity inspector, find the field labeled Class and select RatingControl.
ja: 同一性インスペクタにおいて、Classとラベルをつけられる欄を探してRatingControlを選択してください。

source: In the Identity inspector, find the field labeled Class, and select MealTableViewController.
ja: 同一性インスペクタにおいて、Classとラベルをつけられる欄を探してMealTableViewControllerを選択してください。

source: In the Intrinsic Size field, select Placeholder.
ja: Intrinsic Size（固有サイズ）欄において、Placeholder（プレースホルダ）を選びます。

source: In the Object library, find a Bar Button Item object.
ja: オブジェクトライブラリにおいて、Bar Button Itemオブジェクトを見つけてください。

source: In the Object library, find a Table View Controller object.
ja: オブジェクトライブラリにおいて、Table View Controllerオブジェクトを見つけてください。

source: In the Object library, type button in the filter field to find the Button object quickly.
ja: オブジェクトライブラリにおいて、buttonとフィルタ欄にタイプしてButtonオブジェクトを素早く見つけます。

source: In the Object library, type image view in the filter field to find the Image View object quickly.
ja: オブジェクトライブラリにおいて、image viewをフィルタ欄にタイプしてImage View（イメージビュー）オブジェクトを素早く見つけます。

source: In the Object library, type label in the filter field to find the Label object quickly.
ja: オブジェクトライブラリにおいて、フィルタ欄にlabelとタイプしてラベルオブジェクトを素早く探してください。

source: In the Object library, type tap gesture in the filter field to find the Tap Gesture Recognizer object quickly.
ja: オブジェクトライブラリにおいて、フィルタ欄にtap gestureをタイプしてTap Gesture Recognizerオブジェクトをすばやく見つけます。

source: In the Object library, type text field in the filter field to find the Text Field object quickly.
ja: オブジェクトライブラリにおいて、フィルタ欄（選り分け用単語の入力欄）にtext fieldをタイプしてText Field（テキスト欄）オブジェクトを素早く見つけましょう。

source: In the Pin menu, click the Add 1 Constraints button.
ja: Pinメニューにおいて、Add 1 Constraints（１つの制約を追加）ボタンをクリックしてください。

source: In the Project navigator, drag the Meal.swift file and position it under the other Swift files, if necessary.
ja: Projectナビゲータにおいて、Meal.swiftファイルをドラッグして、それが他のSwiftファイルの下に位置するようにしてください、もし必要ならば。

source: In the Project navigator, reposition the MealTableViewCell.swift file under the other Swift files, if necessary.
ja: Projectナビゲータにおいて、MealTableViewCell.swiftファイルを他のSwiftファイルの下に位置変更してください、もし必要ならば。

source: In the Save As field, type Meal.
ja: Save As欄において、Mealをタイプしてください。

source: In the Scheme pop-up menu in the Xcode toolbar, choose iPhone 7.
ja: XcodeツールバーのSchemeポップアップメニューにおいて、iPhone 7を選んでください。

source: In the Size inspector, find the field labeled Row Height and type 90.
ja: サイズインスペクタにおいて、Row Heightとラベルをつけられる欄を探して90をタイプしてください。

source: In the Size inspector, type 44 in the Height field and 252 in the Width field.
ja: Sizeインスペクタにおいて、Height（高さ）欄に44をWidth（幅）欄に252をタイプしてください。

source: In the Targets section, make sure your app is selected and the tests for your app are unselected.
ja: Targets区画において、あなたのアプリが選択されて、あなたのアプリのためのテストは選択されないことを確かめてください。

source: In the Targets section, your app is selected and the tests for your app are unselected.
ja: Targets区画において、あなたのアプリが選択されて、あなたのアプリのためのテストは選択されません。

source: In the bottom left corner, click the plus (+) button and choose New Folder from the pop-up menu.
ja: １番下左隅で、プラスボタン（+）をクリックしてNew Folderをポップアップメニューから選んでください。

source: In the bottom left corner, click the plus (+) button and choose New Image Set from the pop-up menu.
ja: １番下左隅で、プラス（+）ボタンをクリックしてNew Image Setをポップアップメニューから選んでください

source: In the bottom left corner, click the plus (+) button and select New Folder from the pop-up menu.
ja: １番下左隅で、プラスボタン（+）をクリックしてNew Folderをポップアップメニューから選択してください。

source: In the bottom left corner, click the plus (+) button and select New Image Set from the pop-up menu.
ja: １番下左の隅で、プラス（+）ボタンをクリックしてNew Image Set（新規画像セット）をポップアップメニューから選んでください。

source: In the code above, the indexOf(_:) method attempts to find the selected button in the array of buttons and to return the index at which it was found.
ja: 上のコードにおいて、indexOf(_:)メソッドが試みるのは、選択されたボタンをボタン配列の中で見つけること、そしてそれが見つかったのはどのインデックスかを返すことです。

source: In the code above, you are telling the button to use the empty star image for the normal state.
ja: 上のコードにおいて、あなたは空の星画像を通常状態のために使うようボタンに伝えています。

source: In the code shown above, the first two lines pass a String argument, while the third line passes an Int.
ja: 上で示したコードにおいて、最初の２つの行はString引数を渡します、一方３番目の行はIntを渡します。

source: In the comment at the top of the file, also change the name from ViewController.swift to MealViewController.swift.
ja: このファイルの最上部のコメントにおいてもまた、名前をViewController.swiftからMealViewController.swiftに変更してください。

source: In the current scene, the content view is named View, the top level view inside the View Controller.
ja: 現在のシーンにおいて、コンテンツビューは「View」、View Controller内のトップレベルビュー、と呼ばれます。

source: In the dialog that appears, for Connection select Action.
ja: 現れたダイアログで、Connectionに対してActionを選択します。

source: In the dialog that appears, for Connection, select Action.
ja: 現れたダイアログで、Connectionに対して、Actionを選択します。

source: In the dialog that appears, for Name, type mealNameLabel.
ja: 現れるダイアログにおいて、Nameに対して、mealNameLabelをタイプします。

source: In the dialog that appears, for Name, type nameLabel.
ja: 現れたダイアログにおいて、Nameに、nameLabelをタイプしてください。

source: In the dialog that appears, for Name, type nameTextField.
ja: 現れたダイアログで、Nameに対して、nameTextFieldをタイプします。

source: In the dialog that appears, for Name, type photoImageView.
ja: 現れたダイアログにおいて、名前に、photoImageViewをタイプしてください。

source: In the dialog that appears, for Name, type ratingControl.
ja: 現れたダイアログにおいて、名前に、ratingControlをタイプしてください。

source: In the dialog that appears, for Name, type saveButton.
ja: 現れたダイアログにおいて、名前に、saveButtonをタイプしてください。

source: In the dialog that appears, select a location to save your project and click Create.
ja: 現れるダイアログで、あなたのプロジェクトを保存する場所を選びCreateをクリックしてください。

source: In the dialog that appears, use the following values to name your app and choose additional options for your project:
ja: 現れるダイアログにおいて、以下の値を使ってあなたのアプリに名前をつけて、あなたのプロジェクトのための追加オプションを選んでください。

source: In the editor selector bar, which appears at the top of the assistant editor, change the assistant editor from Preview to Automatic > ViewController.swift.
ja: アシスタントエディタの一番上にある、エディタ選択バーにおいて、アシスタントエディタをPreviewからAutomatic > ViewController.swiftに変更してください。

source: In the editor selector bar, which appears at the top of the assistant editor, switch the assistant editor from Automatic to Preview > Main.storyboard (Preview).
ja: アシスタントエディタの最上部にある、エディタ選択バーにおいて、アシスタントエディタをAutomaticからPreview > Main.storyboard（プレビュー）へ切り替えてください。

source: In the editor selector bar, which appears at the top of the assistant editor, switch the assistant editor from Preview to Automatic > MealTableViewCell.swift.
ja: アシスタントエディタの最上部にある、エディタ選択バーにおいて、アシスタントエディタをPreviewからAutomatic > MealTableViewCell.swiftへ切り替えてください。

source: In the future, as you add more scenes, you’ll make this connection yourself in the Identity inspector.
ja: この先、あなたがさらにシーンを加えるたび、あなたはこの接続をあなた自身で同一性インスペクタにおいて作成することになります。

source: In the lesson, you’ll start making a simple user interface (UI) for the FoodTracker app and view it in the simulator.
ja: このレッスンでは、あなたはFoodTrackerアプリのためのある単純なユーザインターフェイス（UI）の作成を始めます、そしてそれをシミュレータで観察します。

source: In the meal detail scene, select the Meal Name label, and press the Delete key to delete it.
ja: この食事詳細シーンにおいて、Meal Nameラベルを選択してください、そしてデリートキーを押してそれを削除してください。

source: In the method implementation, between the curly braces ({}), add this code:
ja: このメソッド実装において、波括弧（{}）の間に、このコードを加えてください：

source: In the method implementation, between the curly braces ({}), add this line of code:
ja: そのメソッド実装において、波括弧（{}）の間に、このコード行を加えてください：

source: In the new row, make sure the Type is set to String.
ja: 新しい列において、TypeがStringに設定されることを確認してください。

source: In the next lesson, you’ll add a custom control to the scene.
ja: 次のレッスンでは、あなたはあつらえのコントロールをシーンに加えることになります。

source: In the next lesson, you’ll add code to save and load the meal list.
ja: 次のレッスンでは、あなたはコードを加えて食事リストの保存とロードを行います。

source: In the next lesson, you’ll add the ability to edit and delete meals.
ja: 次のレッスンでは、あなたは食事を編集および削除する能力を加えます。

source: In the outline view, select Table View Cell.
ja: アウトラインビューにおいて、Table View Cellを選択してください。

source: In the outline view, select Table View.
ja: アウトラインビューにおいて、Table Viewを選択してください。

source: In the pop-up menu next to Update Frames, choose Items of New Constraints.
ja: Update Framesに接するポップアップメニューで、項目New Constraintsを選んでください。

source: In the pop-up menu, scroll down and choose Privacy - Photo Library Usage Description.
ja: ポップアップメニューにおいて、下にスクロールしてPrivacy - Photo Library Usage Descriptionを選んでください。

source: In the previous lesson, you used the target-action pattern to link elements in your storyboard to action methods in your code.
ja: 以前のレッスンにおいて、あなたはターゲットアクションパターンを使ってあなたのストーリーボードの中の要素をあなたのコードの中のメソッドとリンクしました。

source: In the project navigator, click the ViewController.swift file once and press the Return key.
ja: プロジェクトナビゲータにおいて、ViewController.swiftファイルを一度クリックして、リターンキーを押してください。

source: In the project navigator, select Info.plist.
ja: プロジェクトナビゲータにおいて、Info.plistを選びます。

source: In the project navigator, select Main.storyboard.
ja: プロジェクトナビゲータにおいて、Main.storyboardを選びます。

source: In the project navigator, select ViewController.swift.
ja: プロジェクトナビゲータにおいて、ViewController.swiftを選択してください。

source: In the rating control, each button’s accessibility label describes the value that the button sets.
ja: 格付けコントロールでは、各ボタンの持つアクセシビリティラベルは、そのボタンが設定する値を解説します。

source: In the search field in the top-right corner, type Xcode and press the Return key.
ja: 上部右隅の検索窓で、Xcodeをタイプしてリターンキーを押してください。

source: In the welcome window, click “Create a new Xcode project” (or choose File > New > Project).
ja: Welcomeウインドウにおいて、「Create a new Xcode project」をクリックしてください（または「File > New > Project」を選んでください）。

source: In the workspace window, you may or may not see an error icon with a message that says “Signing for FoodTracker requires a development team.” This warning means you haven’t set up Xcode for iOS development yet, but don’t worry, you can complete these lessons without doing that.
ja: ワークスペースウインドウでは、あなたはエラーアイコンと「FoodTrackerのための署名は開発チームを必要とします。」というメッセージを見るかもしれないし見ないかもしれません。この警告は、あなたがXcodeをiOSのためにまだ設定し終わっていないことを意味します、しかし心配いりません、あなたはこれらのレッスンをそうすることなく完了できます。

source: In the “Subclass of” field, select UIStackView.
ja: 「Subclass of」欄で、UIStackViewを選択してください。

source: In the “Subclass of” field, select UITableViewCell.
ja: 「Subclass of」欄において、UITableViewCellを選んでください。

source: In the “Subclass of” field, select UITableViewController.
ja: 「Subclass」欄において、UITableViewControllerを選択してください。

source: In these lessons, it is assumed that you are familiar with the Swift programming language.
ja: これらのレッスンでは、あなたがSwiftプログラミング言語をよく知っていると仮定します。

source: In these lessons, you’ll be building a simple meal-tracking app called FoodTracker.
ja: これらのレッスンでは、あなたは単純な食事トラッキング（追跡記録）アプリ、FoodTrackerと呼ばれるものを作っています。

source: In this if statement, add the following code:
ja: このif文において、以下のコードを加えてください：

source: In this case, a test case fails if one or more of its test methods fail.
ja: この場合には、あるテスト項目は、それのテストメソッドのひとつ以上が失敗するならば失敗します。

source: In this case, it refers to the RatingControl object that is setting up the buttons.
ja: この場合には、それはボタンを設定しているRatingControlオブジェクトを参照します。

source: In this case, it’s set to iPhone 7 in a portrait orientation, so the canvas and the simulator are the same.
ja: この場合には、それは縦向き方向のiPhone 7 に設定されます、それでキャンバスとシミュレータは同じになります。

source: In this case, it’s the text field’s superview.
ja: この場合、それはテキスト欄の持つスーパービューです。

source: In this case, the unarchiveObject(withFile:) method returns nil.
ja: この場合には、unarchiveObject(withFile:)メソッドはnilを返します。

source: In this case, the Meal class’s initializer fails if you pass an empty string or a negative rating, but doesn’t fail if you pass a rating greater than 5.
ja: この場合には、Mealクラスの持つイニシャライザは、あなたが空の文字列または負の格付けを渡すならば失敗します、しかしあなたが５より大きな格付けを渡すならば失敗しません。

source: In this case, the problem occurs when you attempt to present the image picker.
ja: この場合には、問題はあなたがイメージピッカーを生じさせようと試みるとき起こります。

source: In this case, the scene contains the view controller’s content view, and all of the subviews you added in Interface Builder (the stack view, label, text field, image view, and rating control).
ja: この場合は、シーンはビューコントローラの持つコンテンツビュー、そしてあなたがInterface Builderの中に加えたサブビューの全て（スタックビュー、ラベル、テキスト欄、イメージビュー、そして格付けコントロール）を含みます。

source: In this case, the switch statement prints an error message to the console and terminates the app.
ja: この場合には、switch文はエラーメッセージをコンソールに出力してアプリを終了します。

source: In this case, the text field should already be selected because you just stopped dragging it.
ja: この場合、テキスト欄はすでに選択されているはずです、なぜならあなたがそれのドラッグをちょうど止めたところだからです。

source: In this case, you always want to respond to the user pressing the Return key, so just return true.
ja: この場合には、あなたはユーザがReturnキーを押すことに常に応答したいので、単にtrueを返します。

source: In this case, you are passing valid parameters, so the initializer should never fail.
ja: この場合には、あなたは有効なパラメータを渡しています、それでイニシャライザは決して失敗しないはずです。

source: In this case, you need to set the text field’s delegate property and set the label’s text property.
ja: この場合には、あなたはテキスト欄のdelegateプロパティを設定する、そしてラベルのtextプロパティを設定する必要があります。

source: In this case, your initializer returns an optional Meal? object.
ja: この場合には、あなたのイニシャライザはオプショナルのMeal?オブジェクトを返します。

source: In this case, you’ll make your ViewController instance the text field’s delegate.
ja: この場合には、あなたはあなたのViewControllerインスタンスをテキスト欄のデリゲートにするでしょう。

source: In this case:
ja: この場合には：

source: In this context, the term nearest neighbor means the boundary of the closest user interface element, which can be the superview, another user interface element, or a margin.
ja: この文脈では、最も近い隣りという語は、隣接したユーザインターフェイス要素、それはスーパービュー、別のユーザインターフェイス要素、または余白であるかもしれません、の境界線を意味します。

source: In this custom subclass, you can now define a property to store a list of Meal objects.
ja: このカスタムサブクラスにおいて、あなたは現在ひとつのプロパティを定義してMealオブジェクトのリストを格納します。

source: In this example, only the XCTAssertNil(largeRatingMeal) test actually failed.
ja: この例において、XCTAssertNil(largeRatingMeal)テストだけが実際に失敗します。

source: In this example, the #selector(RatingControl.ratingButtonTapped(_:)) expression returns the selector for your ratingButtonTapped(_:) action method.
ja: この例において、#selector(RatingControl.ratingButtonTapped(_:))式はあなたのratingButtonTapped(_:)アクションメソッドに対するセレクタを返します。

source: In this lesson it is assumed that you have three different images named meal1, meal2, and meal3.
ja: このレッスンではあなたがmeal1、meal2、そしてmeal3と名前を付けられる３つの異なる画像を持つと仮定します。

source: In this lesson, use the iPhone 7 option.
ja: このレッスンでは、iPhone 7オプションを使ってください。

source: In this lesson, you added support to edit and delete meals from the meal list.
ja: このレッスンでは、あなたは食事リストから食事の編集や削除をするためのサポートを加えました。

source: In this lesson, you added the ability to save and load the app’s data.
ja: このレッスンでは、あなたはアプリのデータを保存してロードする能力を加えました。

source: In this lesson, you built a custom table view cell.
ja: このレッスンでは、あなたはカスタムのテーブルビューセルを構築しました。

source: In this lesson, you built a model class to hold your app’s data.
ja: このレッスンでは、あなたはあるモデルクラスを構築してあなたのアプリの持つデータを保持しました。

source: In this lesson, you create a second, table view-based scene, that lists the user’s meals.
ja: このレッスンでは、あなたは２番目の、テーブルビューに基づくシーン、ユーザの食事を一覧にするものを作成します。

source: In this lesson, you focus on adding behavior that allows the user to edit and delete meals in the FoodTracker app.
ja: このレッスンでは、あなたは挙動を追加することに集中します、それはユーザにFoodTrackerアプリにおいて食事の編集と削除を可能にするものです。

source: In this lesson, you learned how to build a custom control that can be displayed in Interface Builder.
ja: このレッスンでは、あなたはカスタムコントロールをビルドする方法を学びました、それはInterface Builderで表示されることができます。

source: In this lesson, you learned how to push scenes onto the navigation stack, and how to present views modally.
ja: このレッスンでは、あなたはシーンをナビゲーションの上へとプッシュする方法、そしてビューをモーダルに表す方法を学びました。

source: In this lesson, you save a meal list across FoodTracker app sessions.
ja: このレッスンでは、あなたはFoodTrackerアプリのセッションをまたいで食事リストを保存します。

source: In this lesson, you use navigation controllers and segues to create the navigation flow of the FoodTracker app.
ja: このレッスンでは、あなたはナビゲーションコントローラとセグエを使って、FoodTrackerアプリのナビゲーションの流れを作成します。

source: In this lesson, you won’t be using any custom app delegate code, so you don’t have to make any changes to the AppDelegate.swift file.
ja: このレッスンでは、あなたは何らあつらえのアプリデリゲートコードを使用しません、それであなたはいかなる変更もAppDelegate.swiftファイルにする必要はありません。

source: In this lesson, you’ll connect the basic user interface (UI) of the FoodTracker app to code and define some actions a user can perform in that UI.
ja: このレッスンでは、あなたはFoodTrackerアプリの基本的なユーザインターフェイス (UI)をコードと結びつけて、ユーザ（利用者）がそのUIにおいて実行できるいくつかのアクションを定義します。

source: In this lesson, you’ll continue to work on the user interface (UI) for the meal scene in the FoodTracker app.
ja: このレッスンでは、あなたはユーザインターフェイス (UI)に関する作業をFoodTrackerアプリの食事シーンのために続けます。

source: In this lesson, you’ll define and test a data model for the FoodTracker app.
ja: このレッスンでは、あなたはFoodTrackerアプリのためのデータモデルを定義してテストします。
